Terraform Plan Output:
```
module.appcd_551e1d2b-88ec-5406-87cf-c51521bbe894.data.aws_caller_identity.current: Reading...
module.appcd_86ec452a-770a-59bf-87dd-67ed883e25e5.aws_cloudwatch_log_group.this: Refreshing state... [id=/aws/lambda/hello-kitty-function]
module.appcd_551e1d2b-88ec-5406-87cf-c51521bbe894.aws_kms_key.custom_s3_kms_key[0]: Refreshing state... [id=5dd52408-8232-4e0d-ab26-7816eab9fa04]
module.appcd_b71fd16c-797e-5a95-8e1b-ab22f1e34f43.aws_iam_role.this: Refreshing state... [id=hello-kitty-role-pratap-908]
module.appcd_551e1d2b-88ec-5406-87cf-c51521bbe894.data.aws_caller_identity.current: Read complete after 0s [id=222634395437]
module.appcd_b11cb310-53b3-4ccc-87ed-6b654f46e2d5.aws_iam_role_policy.this: Refreshing state... [id=hello-kitty-role-pratap-908:Writer]
module.appcd_00a20b0a-2ec0-5bdc-a08d-65a85dc81d5b.aws_lambda_function.this: Refreshing state... [id=hello-kitty-function_pratap_908]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform planned the following actions, but then encountered a problem:

  # module.appcd_095db179-bea1-4845-92ab-c39e77509963.aws_iam_role_policy.this will be created
  + resource "aws_iam_role_policy" "this" {
      + id          = (known after apply)
      + name        = "aws_s3-hello-kitty-policy"
      + name_prefix = (known after apply)
      + policy      = (known after apply)
      + role        = "hello-kitty-role-pratap-908"
    }

  # module.appcd_551e1d2b-88ec-5406-87cf-c51521bbe894.aws_kms_alias.a[0] will be created
  + resource "aws_kms_alias" "a" {
      + arn            = (known after apply)
      + id             = (known after apply)
      + name           = "alias/s3-Cirrus_Bucket"
      + name_prefix    = (known after apply)
      + target_key_arn = (known after apply)
      + target_key_id  = "5dd52408-8232-4e0d-ab26-7816eab9fa04"
    }

  # module.appcd_551e1d2b-88ec-5406-87cf-c51521bbe894.aws_s3_bucket.this will be created
  + resource "aws_s3_bucket" "this" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "Cirrus_Bucket"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags                        = {
          + "appstack"  = "Hello_Stack_Kitty"
          + "component" = "hello-kitty"
        }
      + tags_all                    = {
          + "appstack"  = "Hello_Stack_Kitty"
          + "component" = "hello-kitty"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + cors_rule (known after apply)

      + grant (known after apply)

      + lifecycle_rule (known after apply)

      + logging (known after apply)

      + object_lock_configuration (known after apply)

      + replication_configuration (known after apply)

      + server_side_encryption_configuration (known after apply)

      + versioning (known after apply)

      + website (known after apply)
    }

  # module.appcd_551e1d2b-88ec-5406-87cf-c51521bbe894.aws_s3_bucket_public_access_block.this will be created
  + resource "aws_s3_bucket_public_access_block" "this" {
      + block_public_acls       = true
      + block_public_policy     = true
      + bucket                  = (known after apply)
      + id                      = (known after apply)
      + ignore_public_acls      = true
      + restrict_public_buckets = true
    }

  # module.appcd_551e1d2b-88ec-5406-87cf-c51521bbe894.aws_s3_bucket_server_side_encryption_configuration.this[0] will be created
  + resource "aws_s3_bucket_server_side_encryption_configuration" "this" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + rule {
          + apply_server_side_encryption_by_default {
              + kms_master_key_id = "5dd52408-8232-4e0d-ab26-7816eab9fa04"
              + sse_algorithm     = "aws:kms"
            }
        }
    }

  # module.appcd_551e1d2b-88ec-5406-87cf-c51521bbe894.aws_s3_bucket_versioning.this[0] will be created
  + resource "aws_s3_bucket_versioning" "this" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + versioning_configuration {
          + mfa_delete = (known after apply)
          + status     = "Enabled"
        }
    }

Plan: 6 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + aws_s3_cirrus_bucket_arn                                      = (known after apply)
  + aws_s3_cirrus_bucket_bucket_name                              = (known after apply)

```